import 'package:get/get.dart';

class CoreTranslations extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'kk_KZ': {
          "Язык": "Тіл",
          //
          // "Сервис бронирования\nпопутного транспорта": "",
          // "Попробовать еще раз": "",
          // "Введите номер телефона": "",
          // "Мы отправим СМС с кодом подтверждения": "",
          // "Получить код": "",
          // "Введите корректный номер телефона": "",
          // "SMS отправлено": "",
          // "Ошибка отправки SMS": "",
          // "Введите код": "",
          // "Введите корректный код": "",
          // "На указанный номер было отправлено сообщение с кодом подтверждения": "",
          // "Подтвердить": "",
          // "Ввести другой номер телефона": "",
          // "Ошибка подтверждения": "",
          // "Ошибка получения профиля пользователя": "",
          //
          // "Главная": "",
          // "Настройки": "",
          // "История": "",
          //
          // "Профиль пользователя": "",
          // "Закрыть": "",
          // "Стать водителем": "",
        },
        'ru_RU': {},
      };
}
