import 'package:get/get.dart';

class CoreTranslations extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'kk_KZ': {
          "Язык": "Тіл",
          //
          // "Сервис бронирования\nпопутного транспорта": "",
          // "Попробовать еще раз": "",
          // "Введите номер телефона": "",
          // "Мы отправим СМС с кодом подтверждения": "",
          // "Получить код": "",
          // "Введите корректный номер телефона": "",
          // "SMS отправлено": "",
          // "Ошибка отправки SMS": "",
          // "Введите код": "",
          // "Введите корректный код": "",
          // "На указанный номер было отправлено сообщение с кодом подтверждения": "",
          // "Подтвердить": "",
          // "Ввести другой номер телефона": "",
          // "Ошибка подтверждения": "",
          // "Ошибка получения профиля пользователя": "",
          //
          // "Главная": "",
          // "Настройки": "",
          // "История": "",
          // "Мои заказы": "",
          //
          // "Редактировать": "",
          // "Выйти": "",
          // "Выбрать": "",
          // "Добавить": "",
          //
          // "Профиль пользователя": "",
          // "Закрыть": "",
          // "Стать водителем": "",
          //
          // "Новый заказ": "",
          // "Класс поездки": "",
          // "Откуда": "",
          // "Куда": "",
          // "Укажите или выберите на карте": "",
          // "Нет сохраненных адресов": "",
          // "Выберите время": "",
          // "Комментарий": "",
          // "Статус": "",
          //
          // "Аккаунт водителя": ""
          // status
          "new": "Новый",
          "closed": "Закрыт",
          "canceled": "Отменен"
        },
        'ru_RU': {
          // status
          "new": "Открытая заявка",
          "closed": "Закрыт",
          "canceled": "Отменен"
        },
      };
}
